### Arithmetic and Data Alignment(Aritmetik ve Veri Hizalama)

In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [4]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
              index=['a', 'c', 'e', 'f', 'g'])

In [5]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [6]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [7]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [9]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                  index=['Ohio', 'Texas', 'Colorado'])

In [10]:
 df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [11]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [12]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [13]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [14]:
df1 = pd.DataFrame({'A': [1,2]})

In [15]:
df2 = pd.DataFrame({'B': [3,4]})

In [16]:
df1

   A
0  1
1  2

In [17]:
df2

   B
0  3
1  4

In [19]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In [20]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                  columns=list('abcd'))

In [21]:
df2 - pd.DataFrame(np.arange(20.).reshape((4, 5)),
                  columns=list('abcde'))

    B   a   b   c   d   e
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [25]:
df2.loc[1, 'b'] = np.nan

In [23]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [26]:
df2

   B   b
0  3 NaN
1  4 NaN

In [27]:
df1 + df2

    B   a   b   c   d
0 NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN

In [28]:
df1.add(df2, fill_value=0)

     B    a    b     c     d
0  3.0  0.0  1.0   2.0   3.0
1  4.0  4.0  5.0   6.0   7.0
2  NaN  8.0  9.0  10.0  11.0

In [29]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [30]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [31]:
df1.reindex(columns=df2.columns, fill_value=0)

   B    b
0  0  1.0
1  0  5.0
2  0  9.0

#### Operations between DataFrame and Series

In [33]:
arr = np.arange(12.).reshape(3, 4)

In [34]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [35]:
arr[0]

array([0., 1., 2., 3.])

In [36]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [39]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                    columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [40]:
series = frame.iloc[0]

In [41]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [42]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [43]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [44]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [45]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [46]:
series3 = frame['d']

In [47]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [48]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [49]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

In [50]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [51]:
frame

               b         d         e
Utah   -0.519634  0.073349  0.753857
Ohio    0.052015 -0.097496  1.319941
Texas   0.239784 -0.105028 -0.407991
Oregon  0.362680 -0.706293  2.052407

In [52]:
np.abs(frame)

               b         d         e
Utah    0.519634  0.073349  0.753857
Ohio    0.052015  0.097496  1.319941
Texas   0.239784  0.105028  0.407991
Oregon  0.362680  0.706293  2.052407

In [53]:
f = lambda x: x.max() - x.min()

In [54]:
frame.apply(f)

b    0.882314
d    0.779643
e    2.460398
dtype: float64

In [55]:
frame.apply(f, axis='columns')

Utah      1.273491
Ohio      1.417436
Texas     0.647776
Oregon    2.758700
dtype: float64

In [56]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [57]:
 frame.apply(f)

            b         d         e
min -0.519634 -0.706293 -0.407991
max  0.362680  0.073349  2.052407

In [58]:
format = lambda x: '%.2f' % x

In [59]:
frame.applymap(format)

            b      d      e
Utah    -0.52   0.07   0.75
Ohio     0.05  -0.10   1.32
Texas    0.24  -0.11  -0.41
Oregon   0.36  -0.71   2.05

In [60]:
frame['e'].map(format)

Utah       0.75
Ohio       1.32
Texas     -0.41
Oregon     2.05
Name: e, dtype: object

### Sorting and Ranking

In [3]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [4]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [5]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index=['three', 'one'],
                    columns=['d','a','b','c'])

In [6]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [7]:
frame.sort_index(axis=1) #sutuna gre sralama yapar.

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [8]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [9]:
obj = pd.Series([4, 7, -3, 2])

In [10]:
obj.sort_values() #kkten bye

2   -3
3    2
0    4
1    7
dtype: int64

In [11]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [12]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [13]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [14]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [15]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [16]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [17]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [19]:
obj.rank() #degerleri sralayp indexlere gre gsterir

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [20]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [22]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [23]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                     'c': [-2, 5, 8, -2.5]})

In [24]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [25]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [26]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [27]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [28]:
obj.index.is_unique

False

In [29]:
obj['a']

a    0
a    1
dtype: int64

In [30]:
obj['c']

4

In [31]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [32]:
df

          0         1         2
a  0.135880  0.676641  0.009154
a -0.163571  0.832722  1.716748
b  0.018226 -0.467725  0.199834
b -1.350212  0.706770 -2.054199

In [33]:
df.loc['b']

          0         1         2
b  0.018226 -0.467725  0.199834
b -1.350212  0.706770 -2.054199

## 5.3 Summarizing and Computing Descriptive Statistics

In [3]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [4]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [7]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [8]:
df.idxmax()

one    b
two    d
dtype: object

In [9]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [10]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [11]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [12]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

In [16]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

ModuleNotFoundError: No module named 'pandas_datareader'

In [17]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})

NameError: name 'all_data' is not defined

In [18]:
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

NameError: name 'all_data' is not defined

In [19]:
returns = price.pct_change()

NameError: name 'price' is not defined

----devam hi olmad 179.sayfa---

### Unique Values, Value Counts, and Membership

In [20]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [21]:
uniques = obj.unique()

In [22]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [23]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [24]:
pd.value_counts(obj.values, sort=False)

d    1
a    3
b    2
c    3
dtype: int64

In [25]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [26]:
mask = obj.isin(['b', 'c'])

In [27]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [28]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [29]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [30]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [31]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [32]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})

In [33]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [34]:
result = data.apply(pd.value_counts).fillna(0)

In [35]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

#### CHAPTER 6
## Data Loading, Storage, and File Formats

### 6.1 Reading and Writing Data in Text Format

186. sayfay cvs den dolay atladn oray yap..

In [36]:
names = ['a', 'b', 'c', 'd', 'message']

### XML and HTML: Web Scraping

In [37]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

ValueError: No tables found

#### CHAPTER 7
## Data Cleaning and Preparation

### 7.1 Handling Missing Data

In [38]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [39]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [40]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [41]:
string_data[0] = None

In [42]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [43]:
from numpy import nan as NA

In [44]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [45]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [46]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [47]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [48]:
cleaned = data.dropna()

In [49]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [50]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [51]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [52]:
data[4] = NA

In [53]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [54]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [55]:
df = pd.DataFrame(np.random.randn(7, 3))

In [56]:
df.iloc[:4, 1] = NA

In [57]:
df.iloc[:2, 2] = NA

In [58]:
df

          0         1         2
0  0.622023       NaN       NaN
1  0.863487       NaN       NaN
2 -0.763395       NaN  1.515079
3  0.404329       NaN  1.536006
4 -0.854812  0.619361  0.205885
5 -0.289274 -0.923978 -0.397156
6 -0.165156 -2.725514  0.109979

In [59]:
df.dropna()

          0         1         2
4 -0.854812  0.619361  0.205885
5 -0.289274 -0.923978 -0.397156
6 -0.165156 -2.725514  0.109979

In [60]:
df.dropna(thresh=2)

          0         1         2
2 -0.763395       NaN  1.515079
3  0.404329       NaN  1.536006
4 -0.854812  0.619361  0.205885
5 -0.289274 -0.923978 -0.397156
6 -0.165156 -2.725514  0.109979

### Filling In Missing Data

In [61]:
df.fillna(0)

          0         1         2
0  0.622023  0.000000  0.000000
1  0.863487  0.000000  0.000000
2 -0.763395  0.000000  1.515079
3  0.404329  0.000000  1.536006
4 -0.854812  0.619361  0.205885
5 -0.289274 -0.923978 -0.397156
6 -0.165156 -2.725514  0.109979

In [62]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.622023  0.500000  0.000000
1  0.863487  0.500000  0.000000
2 -0.763395  0.500000  1.515079
3  0.404329  0.500000  1.536006
4 -0.854812  0.619361  0.205885
5 -0.289274 -0.923978 -0.397156
6 -0.165156 -2.725514  0.109979

In [63]:
_ = df.fillna(0, inplace=True)

In [64]:
df

          0         1         2
0  0.622023  0.000000  0.000000
1  0.863487  0.000000  0.000000
2 -0.763395  0.000000  1.515079
3  0.404329  0.000000  1.536006
4 -0.854812  0.619361  0.205885
5 -0.289274 -0.923978 -0.397156
6 -0.165156 -2.725514  0.109979

In [65]:
df = pd.DataFrame(np.random.randn(6, 3))

In [66]:
df.iloc[2:, 1] = NA

In [67]:
df.iloc[4:, 2] = NA

In [68]:
df

          0         1         2
0  1.759964  1.414207  2.171268
1 -0.651369  0.400837  0.108069
2 -0.942476       NaN -0.142693
3  1.772228       NaN  0.410197
4  1.126767       NaN       NaN
5  1.734778       NaN       NaN

In [69]:
df.fillna(method='ffill')

          0         1         2
0  1.759964  1.414207  2.171268
1 -0.651369  0.400837  0.108069
2 -0.942476  0.400837 -0.142693
3  1.772228  0.400837  0.410197
4  1.126767  0.400837  0.410197
5  1.734778  0.400837  0.410197

In [70]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.759964  1.414207  2.171268
1 -0.651369  0.400837  0.108069
2 -0.942476  0.400837 -0.142693
3  1.772228  0.400837  0.410197
4  1.126767       NaN  0.410197
5  1.734778       NaN  0.410197

In [71]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [72]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

### Removing Duplicates

In [73]:
 data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                      'k2': [1, 1, 2, 3, 3, 4, 4]})

In [74]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [75]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [76]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [77]:
data['v1'] = range(7)

In [78]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [79]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [80]:
 data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                               'pastrami', 'honey ham', 'nova lox'],
                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [81]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [82]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [83]:
lowercased = data['food'].str.lower()

In [84]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [85]:
data['animal'] = lowercased.map(meat_to_animal)

In [87]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [88]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [89]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [90]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [91]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [92]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [93]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [94]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [95]:
 data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                     index=['Ohio', 'Colorado', 'New York'],
                     columns=['one', 'two', 'three', 'four'])

In [96]:
transform = lambda x: x[:4].upper()

In [97]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [98]:
data.index = data.index.map(transform)

In [99]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [100]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [101]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [102]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [103]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [104]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [105]:
bins = [18, 25, 35, 60, 100]

In [106]:
cats = pd.cut(ages, bins)

In [107]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

### Discretization and Binning

In [108]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [109]:
bins = [18, 25, 35, 60, 100]

In [110]:
cats = pd.cut(ages, bins)

In [111]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [112]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [113]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [114]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [115]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [116]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [117]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [118]:
data = np.random.rand(20)

In [119]:
pd.cut(data, 4, precision=2)

[(0.75, 0.99], (0.047, 0.28], (0.52, 0.75], (0.28, 0.52], (0.75, 0.99], ..., (0.52, 0.75], (0.75, 0.99], (0.75, 0.99], (0.28, 0.52], (0.28, 0.52]]
Length: 20
Categories (4, interval[float64]): [(0.047, 0.28] < (0.28, 0.52] < (0.52, 0.75] < (0.75, 0.99]]

In [120]:
data = np.random.randn(1000)

In [121]:
cats = pd.qcut(data, 4)

In [122]:
cats

[(-0.631, 0.0307], (0.0307, 0.692], (-3.36, -0.631], (0.0307, 0.692], (0.692, 2.992], ..., (0.0307, 0.692], (0.692, 2.992], (-3.36, -0.631], (-0.631, 0.0307], (0.692, 2.992]]
Length: 1000
Categories (4, interval[float64]): [(-3.36, -0.631] < (-0.631, 0.0307] < (0.0307, 0.692] < (0.692, 2.992]]

In [123]:
pd.value_counts(cats)

(0.692, 2.992]      250
(0.0307, 0.692]     250
(-0.631, 0.0307]    250
(-3.36, -0.631]     250
dtype: int64

In [124]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.178, 0.0307], (0.0307, 1.307], (-1.178, 0.0307], (0.0307, 1.307], (0.0307, 1.307], ..., (0.0307, 1.307], (0.0307, 1.307], (-1.178, 0.0307], (-1.178, 0.0307], (1.307, 2.992]]
Length: 1000
Categories (4, interval[float64]): [(-3.36, -1.178] < (-1.178, 0.0307] < (0.0307, 1.307] < (1.307, 2.992]]

### Detecting and Filtering Outliers

In [2]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [3]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.068989    -0.010481     0.014950     0.027685
std       1.001234     0.999995     0.970739     1.037724
min      -3.121115    -3.214250    -3.493501    -3.225909
25%      -0.761717    -0.707458    -0.634901    -0.647635
50%      -0.064474    -0.000489     0.015301     0.065257
75%       0.626543     0.677186     0.645421     0.713799
max       2.919637     2.892845     3.286900     3.895169

In [4]:
col = data[2]

In [5]:
col[np.abs(col) > 3]

302   -3.493501
811   -3.144084
962    3.286900
Name: 2, dtype: float64

In [6]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
25  -1.089805 -0.076426 -0.808779  3.593529
133 -3.121115 -0.857370  0.558832 -1.021831
141 -0.487310 -3.214250 -0.379913 -1.978519
196  0.801561 -0.357334 -0.454191 -3.114393
302  1.722423 -0.359717 -3.493501 -0.712945
607  1.005256  0.718357  1.512123  3.456402
683 -0.409271 -0.286601  1.457339 -3.225909
811  0.541109 -1.483846 -3.144084 -2.088576
892  0.979423 -1.171615 -1.138544  3.895169
962  0.977134  0.538749  3.286900 -1.248596

In [7]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [8]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.068868    -0.010267     0.015301     0.026080
std       1.000871     0.999331     0.967690     1.030439
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.761717    -0.707458    -0.634901    -0.647635
50%      -0.064474    -0.000489     0.015301     0.065257
75%       0.626543     0.677186     0.645421     0.713799
max       2.919637     2.892845     3.000000     3.000000

In [9]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1 -1.0  1.0  1.0  1.0
2 -1.0 -1.0  1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4 -1.0  1.0  1.0 -1.0

### Permutation and Random Sampling

In [10]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [11]:
sampler = np.random.permutation(5)

In [12]:
sampler

array([2, 3, 4, 1, 0])

In [13]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [14]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

In [15]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [16]:
choices = pd.Series([5, 7, -1, 6, 4])

In [17]:
draws = choices.sample(n=10, replace=True)

In [18]:
draws

1    7
4    4
1    7
3    6
0    5
3    6
1    7
4    4
4    4
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [19]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [20]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [21]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [22]:
df_with_dummy = df[['data1']].join(dummies)

In [23]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [24]:
mnames = ['movie_id', 'title', 'genres']

In [25]:
 movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                         header=None, names=mnames)

<ipython-input-25-49be4f536fc2>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movielens/movies.dat', sep='::',

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

In [26]:
movies[:10]

NameError: name 'movies' is not defined

In [27]:
all_genres = []

In [28]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

NameError: name 'movies' is not defined

In [29]:
genres = pd.unique(all_genres)

In [30]:
genres

array([], dtype=float64)

In [31]:
zero_matrix = np.zeros((len(movies), len(genres)))

NameError: name 'movies' is not defined

In [32]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

NameError: name 'zero_matrix' is not defined

In [33]:
gen = movies.genres[0]

NameError: name 'movies' is not defined

In [34]:
gen.split('|')

NameError: name 'gen' is not defined

In [35]:
dummies.columns.get_indexer(gen.split('|'))

NameError: name 'gen' is not defined

In [36]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

NameError: name 'movies' is not defined

In [37]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

NameError: name 'movies' is not defined

In [38]:
movies_windic.iloc[0]

NameError: name 'movies_windic' is not defined

In [39]:
np.random.seed(12345)

In [40]:
values = np.random.rand(10)

In [41]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [42]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [43]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 7.3 String Manipulation

### String Object Methods

In [45]:
val = 'a,b, guido'

In [46]:
val.split(',')

['a', 'b', ' guido']

In [47]:
pieces = [x.strip() for x in val.split(',')]

In [48]:
pieces

['a', 'b', 'guido']

In [49]:
first, second, third = pieces

In [50]:
first + '::' + second + '::' + third

'a::b::guido'

In [51]:
'::'.join(pieces)

'a::b::guido'

In [52]:
'guido' in val

True

In [54]:
val.index(',')

1

In [55]:
val.find(':')

-1

In [56]:
val.index(':')

ValueError: substring not found

In [57]:
val.count(',')

2

In [58]:
val.replace(',', '::')

'a::b:: guido'

In [59]:
val.replace(',', '')

'ab guido'

### Regular Expressions

In [60]:
import re

In [61]:
text = "foo bar\t baz \tqux"

In [62]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [63]:
regex = re.compile('\s+')

In [64]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [65]:
regex.findall(text)

[' ', '\t ', ' \t']

In [66]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [67]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [68]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [69]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [70]:
m = regex.search(text)

In [71]:
m

In [72]:
text[m.start():m.end()]

'dave@google.com'

In [73]:
print(regex.match(text))

None

In [74]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [75]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [76]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [77]:
m = regex.match('wesm@bright.net')

In [80]:
m.groups()

('wesm', 'bright', 'net')

In [79]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

### Vectorized String Functions in pandas

In [83]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [84]:
data = pd.Series(data)

In [85]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [86]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [87]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [88]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [89]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [90]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [91]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [92]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [93]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [94]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

#### CHAPTER 8
## Data Wrangling: Join, Combine,
## and Reshape

## 8.1 Hierarchical Indexing

In [5]:
data = pd.Series(np.random.randn(9),
                  index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                         [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [6]:
data

a  1   -0.110234
   2    0.931384
   3    0.644881
b  1    1.315435
   3   -0.437258
c  1    0.400148
   2   -1.036192
d  2   -0.557996
   3   -0.261231
dtype: float64

In [7]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [8]:
data['b']

1    1.315435
3   -0.437258
dtype: float64

In [9]:
data['b':'c']

b  1    1.315435
   3   -0.437258
c  1    0.400148
   2   -1.036192
dtype: float64

In [10]:
data.loc[['b', 'd']]

b  1    1.315435
   3   -0.437258
d  2   -0.557996
   3   -0.261231
dtype: float64

In [11]:
data.loc[:, 2]

a    0.931384
c   -1.036192
d   -0.557996
dtype: float64

In [12]:
data.unstack()

          1         2         3
a -0.110234  0.931384  0.644881
b  1.315435       NaN -0.437258
c  0.400148 -1.036192       NaN
d       NaN -0.557996 -0.261231

In [13]:
data.unstack().stack()

a  1   -0.110234
   2    0.931384
   3    0.644881
b  1    1.315435
   3   -0.437258
c  1    0.400148
   2   -1.036192
d  2   -0.557996
   3   -0.261231
dtype: float64

In [14]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])

In [15]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [16]:
frame.index.names = ['key1', 'key2']

In [17]:
frame.columns.names = ['state', 'color']

In [18]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [19]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### Reordering and Sorting Levels

In [20]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [21]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [22]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary Statistics by Level

In [23]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [24]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Indexing with a DataFrames columns

In [25]:
 frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                       'c': ['one', 'one', 'one', 'two', 'two',
                             'two', 'two'],
                       'd': [0, 1, 2, 0, 1, 2, 3]})

In [26]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [27]:
frame2 = frame.set_index(['c', 'd'])

In [28]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [29]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [30]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 8.2 Combining and Merging Datasets

### Database-Style DataFrame Joins

In [31]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})

In [32]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})

In [33]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [34]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [35]:
 pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [36]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [37]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                     'data1': range(7)})

In [38]:
 df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                     'data2': range(3)})

In [39]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [40]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [41]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})

In [42]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': range(5)})

In [43]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [44]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [45]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [46]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [47]:
 left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                      'key2': ['one', 'two', 'one'],
                      'lval': [1, 2, 3]})

In [48]:
 right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                       'key2': ['one', 'one', 'one', 'two'],
                       'rval': [4, 5, 6, 7]})

In [49]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [51]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [52]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### Merging on Index

In [53]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})

In [54]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [55]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [56]:
right1

   group_val
a        3.5
b        7.0

In [57]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [58]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [59]:
 lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
                                'Nevada', 'Nevada'],
                       'key2': [2000, 2001, 2002, 2001, 2002],
                       'data': np.arange(5.)})

In [60]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
                              'Ohio', 'Ohio'],
                             [2001, 2000, 2000, 2000, 2001, 2002]],
                      columns=['event1', 'event2'])

In [61]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [62]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [63]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [64]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [65]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada'])

In [66]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])

In [67]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [68]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [69]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [70]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [71]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [72]:
 another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                        index=['a', 'c', 'e', 'f'],
                        columns=['New York', 'Oregon'])

In [73]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [74]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [75]:
left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

### Concatenating Along an Axis

In [3]:
arr = np.arange(12).reshape((3, 4))

In [4]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [5]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [6]:
s1 = pd.Series([0, 1], index=['a', 'b'])

In [7]:
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

In [8]:
s3 = pd.Series([5, 6], index=['f', 'g'])

In [9]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [10]:
 pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [11]:
s4 = pd.concat([s1, s3])

In [12]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [13]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [14]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [15]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [16]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])

In [17]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [18]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [19]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [20]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                   columns=['one', 'two'])

In [21]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                   columns=['three', 'four'])

In [22]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [23]:
df2

   three  four
a      5     6
c      7     8

In [24]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [25]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [26]:
 pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
           names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [27]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])

In [28]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [29]:
df1

          a         b         c         d
0  0.953414  1.917236 -0.898725 -0.297846
1  0.607671 -0.098160  1.033463  1.175103
2  0.510421  0.819701  0.014617 -0.592834

In [30]:
df2

          b         d         a
0 -0.589632  0.096892  2.594912
1 -0.270121  0.792041  2.393930

In [31]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0  0.953414  1.917236 -0.898725 -0.297846
1  0.607671 -0.098160  1.033463  1.175103
2  0.510421  0.819701  0.014617 -0.592834
3  2.594912 -0.589632       NaN  0.096892
4  2.393930 -0.270121       NaN  0.792041

### Combining Data with Overlap

In [32]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a'])

In [33]:
b = pd.Series(np.arange(len(a), dtype=np.float64),
              index=['f', 'e', 'd', 'c', 'b', 'a'])

In [34]:
b[-1] = np.nan

In [35]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [36]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [37]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [38]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [39]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    'b': [np.nan, 2., np.nan, 6.],
                    'c': range(2, 18, 4)})

In [40]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    'b': [np.nan, 3., 4., 6., 8.]})

In [41]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [42]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [43]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

## 8.3 Reshaping and Pivoting

### Reshaping with Hierarchical Indexing

In [44]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'],
                    name='number'))

In [45]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [46]:
result = data.stack()

In [47]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [48]:
 result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [49]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [50]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [51]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])

In [52]:
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [53]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [54]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [55]:
 data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [56]:
 data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [57]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [58]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [59]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))

In [60]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [61]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [62]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7